Autodesk.Revit.DB.ElementComparerByIdData.Order
The order in which objects are to be sorted.
Since:
2015

Autodesk.Revit.DB.ElementComparerByIdData.#ctor
Default constructor
Remarks:
Creates an instance of the data class set for ascending order.
Use the Order property to change the direction of sorting order.
Since:
2015

Autodesk.Revit.DB.ElementComparerByIdData
Data class that defines behavior of a comparer that uses Element Ids
to compare elements when sorting them in order to assign numbers to them.
Remarks:
This comparer is used by default if no other comparer is explicitly specified.
Since:
2015